In [1]:
import numpy as np
import pandas as pd

In [101]:
dogs=pd.read_csv('./dataset/dogs.csv')

In [3]:
dogs

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella      Labrador   Brown           56           25     2013-07-01
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
4      Max      Labrador   Black           59           29     2017-01-20
5   Stella     Chihuahua     Tan           18            2     2015-04-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [4]:
dogs.head(5)

      Name       Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella    Labrador   Brown           56           25     2013-07-01
1  Charlie      Poodle   Black           43           23     2016-09-16
2     Lucy        Chow   Brown           46           22     2014-08-25
3   Cooper   Schnauzer    Gray           49           17     2011-12-11
4      Max    Labrador   Black           59           29     2017-01-20

In [5]:
dogs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            7 non-null      object
 1   Breed           7 non-null      object
 2    Color          7 non-null      object
 3    Height(cm)     7 non-null      int64
 4    Weight(kg)     7 non-null      int64
 5    Date of Birth  7 non-null      object
dtypes: int64(2), object(4)
memory usage: 464.0+ bytes

In [6]:
dogs.shape

(7, 6)

In [7]:
dogs.describe()

        Height(cm)   Weight(kg)
count     7.000000     7.000000
mean     49.714286    27.428571
std      17.960274    22.292429
min      18.000000     2.000000
25%      44.500000    19.500000
50%      49.000000    23.000000
75%      57.500000    27.000000
max      77.000000    74.000000

In [8]:
dogs.values

array([['Bella', ' Labrador', ' Brown', 56, 25, ' 2013-07-01'],
       ['Charlie', ' Poodle', ' Black', 43, 23, ' 2016-09-16'],
       ['Lucy', ' Chow', ' Brown', 46, 22, ' 2014-08-25'],
       ['Cooper', ' Schnauzer', ' Gray', 49, 17, ' 2011-12-11'],
       ['Max', ' Labrador', ' Black', 59, 29, ' 2017-01-20'],
       ['Stella', ' Chihuahua', ' Tan', 18, 2, ' 2015-04-20'],
       ['Bernie', ' St. Bernard', ' White', 77, 74, ' 2018-02-2']],
      dtype=object)

In [9]:
dogs.columns

Index(['Name', 'Breed', ' Color', ' Height(cm)', ' Weight(kg)',
       ' Date of Birth'],
      dtype='object')

In [10]:
dogs.index

RangeIndex(start=0, stop=7, step=1)

##### 1- sorting &  subsetting

In [11]:
dogs.sort_values(by=' Height(cm)')

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [12]:
dogs.sort_values(by=" Weight(kg)")

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
2     Lucy          Chow   Brown           46           22     2014-08-25
1  Charlie        Poodle   Black           43           23     2016-09-16
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [13]:
dogs.sort_values(by=' Height(cm)', ascending='False')

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [14]:
dogs.sort_values([' Height(cm)', ' Color'])

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [15]:
dogs.sort_values([' Height(cm)', ' Color'], ascending=[True,False])

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [16]:
dogs["Name"]

0      Bella
1    Charlie
2       Lucy
3     Cooper
4        Max
5     Stella
6     Bernie
Name: Name, dtype: object

In [17]:
dogs[["Name","Breed"," Color"]]

      Name         Breed   Color
0    Bella      Labrador   Brown
1  Charlie        Poodle   Black
2     Lucy          Chow   Brown
3   Cooper     Schnauzer    Gray
4      Max      Labrador   Black
5   Stella     Chihuahua     Tan
6   Bernie   St. Bernard   White

In [18]:
dogs[" Height(cm)"]>15

0    True
1    True
2    True
3    True
4    True
5    True
6    True
Name:  Height(cm), dtype: bool

In [19]:
dogs[dogs[" Height(cm)"]>15]

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella      Labrador   Brown           56           25     2013-07-01
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
4      Max      Labrador   Black           59           29     2017-01-20
5   Stella     Chihuahua     Tan           18            2     2015-04-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [20]:
dogs["Breed"]==" Poodle"

0    False
1     True
2    False
3    False
4    False
5    False
6    False
Name: Breed, dtype: bool

In [21]:
dogs[dogs[" Color"]==" Brown"]

    Name      Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0  Bella   Labrador   Brown           56           25     2013-07-01
2   Lucy       Chow   Brown           46           22     2014-08-25

In [22]:
name=dogs["Name"]=="Lucy"
color=dogs[" Color"]==" Brown"
dogs[name & color]

   Name  Breed   Color   Height(cm)   Weight(kg)  Date of Birth
2  Lucy   Chow   Brown           46           22     2014-08-25

In [23]:
dogs['Name'].isin(["Bella","Charlie"])

0     True
1     True
2    False
3    False
4    False
5    False
6    False
Name: Name, dtype: bool

#### 2- Creating New Columns

In [24]:
dogs["Ratio"]=np.array(dogs[" Height(cm)"])/np.array(dogs[" Weight(kg)"])

In [25]:
dogs

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,Ratio
0,Bella,Labrador,Brown,56,25,2013-07-01,2.240000
1,Charlie,Poodle,Black,43,23,2016-09-16,1.869565
2,Lucy,Chow,Brown,46,22,2014-08-25,2.090909
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,2.882353
4,Max,Labrador,Black,59,29,2017-01-20,2.034483
5,Stella,Chihuahua,Tan,18,2,2015-04-20,9.000000
6,Bernie,St. Bernard,White,77,74,2018-02-2,1.040541

### Aggregating Data

In [27]:
dogs[' Height(cm)'].mean()

49.714285714285715

In [28]:
dogs[' Height(cm)'].mode()

0    18
1    43
2    46
3    49
4    56
5    59
6    77
dtype: int64

In [30]:
dogs[" Height(cm)"].min()

18

In [31]:
dogs[" Height(cm)"].max()

77

In [32]:
dogs[' Height(cm)'].var() #<--Return unbiased variance over requested axis.

322.5714285714286

In [33]:
dogs[' Height(cm)'].quantile() #<--Return values at the given quantile over requested axis.

49.0

In [34]:
dogs[' Height(cm)'].std()

17.960273621841864

In [35]:
dogs[' Height(cm)'].sum()

348

### Summarize dates

In [37]:
dogs[' Date of Birth'].min()

' 2011-12-11'

In [38]:
dogs[' Date of Birth'].max()

' 2018-02-2'

### .agg() Method

In [39]:
dogs

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,Ratio
0,Bella,Labrador,Brown,56,25,2013-07-01,2.240000
1,Charlie,Poodle,Black,43,23,2016-09-16,1.869565
2,Lucy,Chow,Brown,46,22,2014-08-25,2.090909
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,2.882353
4,Max,Labrador,Black,59,29,2017-01-20,2.034483
5,Stella,Chihuahua,Tan,18,2,2015-04-20,9.000000
6,Bernie,St. Bernard,White,77,74,2018-02-2,1.040541

In [40]:
def pct30(column):
    return column.quantile(0.3)

In [41]:
dogs[' Weight(kg)'].agg(pct30)#<-- applying agg() on a column using simple function

21.0

In [42]:
dogs[' Weight(kg)'].agg(lambda col : col.quantile(.3))

21.0

In [43]:
#On multiple column
dogs[[' Height(cm)', ' Weight(kg)']].agg(lambda x: x.quantile(0.3))

 Height(cm)    45.4
 Weight(kg)    21.0
dtype: float64

In [44]:
#Multiple summarize
def pct40(column): 
    return column.quantile(0.4)

In [47]:
dogs[' Weight(kg)'].agg([pct30,pct40])

pct30    21.0
pct40    22.4
Name:  Weight(kg), dtype: float64

### Cummalative Statistics

In [50]:
pd.DataFrame(dogs[' Weight(kg)'].cumsum())

    Weight(kg)
0           25
1           48
2           70
3           87
4          116
5          118
6          192

### Drop Duplicates

In [54]:
dogs

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,Ratio
0,Bella,Labrador,Brown,56,25,2013-07-01,2.240000
1,Charlie,Poodle,Black,43,23,2016-09-16,1.869565
2,Lucy,Chow,Brown,46,22,2014-08-25,2.090909
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,2.882353
4,Max,Labrador,Black,59,29,2017-01-20,2.034483
5,Stella,Chihuahua,Tan,18,2,2015-04-20,9.000000
6,Bernie,St. Bernard,White,77,74,2018-02-2,1.040541

In [53]:
dogs.drop_duplicates(subset = " Color")

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,Ratio
0,Bella,Labrador,Brown,56,25,2013-07-01,2.240000
1,Charlie,Poodle,Black,43,23,2016-09-16,1.869565
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,2.882353
5,Stella,Chihuahua,Tan,18,2,2015-04-20,9.000000
6,Bernie,St. Bernard,White,77,74,2018-02-2,1.040541

### .values_count()

In [55]:
pd.DataFrame(dogs[' Height(cm)'].value_counts()) # Sort by Default True

     Height(cm)
49            1
18            1
56            1
43            1
59            1
77            1
46            1

In [58]:
pd.DataFrame(dogs[' Height(cm)'].value_counts(sort=False))

     Height(cm)
49            1
18            1
56            1
43            1
59            1
77            1
46            1

In [59]:
pd.DataFrame(dogs[' Height(cm)'].value_counts(normalize=True))

     Height(cm)
49     0.142857
18     0.142857
56     0.142857
43     0.142857
59     0.142857
77     0.142857
46     0.142857

### Group Summay Statistics

In [76]:
pd.DataFrame(dogs[' Color'].value_counts(normalize=True))

           Color
 Brown  0.285714
 Black  0.285714
 Gray   0.142857
 White  0.142857
 Tan    0.142857

In [61]:
dogs[dogs[' Color'] == ' Brown'][' Height(cm)'].mean()

51.0

In [63]:
dogs[dogs[' Color'] == ' Tan'][' Height(cm)'].mean()

18.0

In [64]:
dogs.groupby(' Color')[' Height(cm)'].mean()

 Color
 Black    51
 Brown    51
 Gray     49
 Tan      18
 White    77
Name:  Height(cm), dtype: int64

In [66]:
pd.DataFrame(dogs.groupby(' Color')[' Height(cm)'].mean())

         Height(cm)
 Color
 Black           51
 Brown           51
 Gray            49
 Tan             18
 White           77

In [67]:
dogs

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,Ratio
0,Bella,Labrador,Brown,56,25,2013-07-01,2.240000
1,Charlie,Poodle,Black,43,23,2016-09-16,1.869565
2,Lucy,Chow,Brown,46,22,2014-08-25,2.090909
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,2.882353
4,Max,Labrador,Black,59,29,2017-01-20,2.034483
5,Stella,Chihuahua,Tan,18,2,2015-04-20,9.000000
6,Bernie,St. Bernard,White,77,74,2018-02-2,1.040541

In [68]:
dogs.groupby([' Color', 'Breed'])[' Weight(kg)'].count() # < -- multiple group

 Color  Breed
 Black   Labrador       1
         Poodle         1
 Brown   Chow           1
         Labrador       1
 Gray    Schnauzer      1
 Tan     Chihuahua      1
 White   St. Bernard    1
Name:  Weight(kg), dtype: int64

In [69]:
dogs.groupby(' Color')['Breed'].agg(['count', 'min', 'max'])# <-- multiple stats

        count           min           max
 Color
 Black      2      Labrador        Poodle
 Brown      2          Chow      Labrador
 Gray       1     Schnauzer     Schnauzer
 Tan        1     Chihuahua     Chihuahua
 White      1   St. Bernard   St. Bernard

### Pivot Table

In [77]:
#pivot and implicitly define agffunc=np.mean
dogs.pivot_table(values = ' Height(cm)', index='Breed')

               Height(cm)
Breed
 Chihuahua           18.0
 Chow                46.0
 Labrador            57.5
 Poodle              43.0
 Schnauzer           49.0
 St. Bernard         77.0

In [81]:
dogs.pivot_table(values = ' Height(cm)', index='Breed',aggfunc=np.median)

               Height(cm)
Breed
 Chihuahua           18.0
 Chow                46.0
 Labrador            57.5
 Poodle              43.0
 Schnauzer           49.0
 St. Bernard         77.0

In [92]:
dogs.pivot_table(values = ' Height(cm)', index='Breed',aggfunc=[np.median,np.std])

                  median         std
              Height(cm)  Height(cm)
Breed
 Chihuahua          18.0         NaN
 Chow               46.0         NaN
 Labrador           57.5     2.12132
 Poodle             43.0         NaN
 Schnauzer          49.0         NaN
 St. Bernard        77.0         NaN

### Pivot on two Variables

In [94]:
#in groupby

#dogs.groupby(['Survived','Sex'])['Age'].mean().unstack()

dogs.groupby([' Color', 'Breed'])[' Weight(kg)'].mean().unstack()

Breed    Chihuahua   Chow   Labrador   Poodle   Schnauzer   St. Bernard
 Color
 Black         NaN    NaN       29.0     23.0         NaN           NaN
 Brown         NaN   22.0       25.0      NaN         NaN           NaN
 Gray          NaN    NaN        NaN      NaN        17.0           NaN
 Tan           2.0    NaN        NaN      NaN         NaN           NaN
 White         NaN    NaN        NaN      NaN         NaN          74.0

In [95]:
#pivot on two varibales
dogs.pivot_table(values=' Weight(kg)', index=' Color', columns='Breed')

Breed    Chihuahua   Chow   Labrador   Poodle   Schnauzer   St. Bernard
 Color
 Black         NaN    NaN       29.0     23.0         NaN           NaN
 Brown         NaN   22.0       25.0      NaN         NaN           NaN
 Gray          NaN    NaN        NaN      NaN        17.0           NaN
 Tan           2.0    NaN        NaN      NaN         NaN           NaN
 White         NaN    NaN        NaN      NaN         NaN          74.0

#### filling missing values in pivot table

In [97]:
dogs.pivot_table(values=' Weight(kg)', index=' Color', columns='Breed',fill_value=0)

Breed    Chihuahua   Chow   Labrador   Poodle   Schnauzer   St. Bernard
 Color
 Black           0      0         29       23           0             0
 Brown           0     22         25        0           0             0
 Gray            0      0          0        0          17             0
 Tan             2      0          0        0           0             0
 White           0      0          0        0           0            74

In [98]:
### Summing with pivot tables
dogs.pivot_table(values=' Weight(kg)', index=' Color', columns='Breed',fill_value=0,margins=True)

Breed    Chihuahua   Chow   Labrador   Poodle   Schnauzer   St. Bernard   All
 Color
 Black           0      0         29       23           0             0  26.0
 Brown           0     22         25        0           0             0  23.5
 Gray            0      0          0        0          17             0  17.0
 Tan             2      0          0        0           0             0   2.0
 White           0      0          0        0           0            74  74.0
All              2     22         27       23          17            74  27.0

-------End-------------